import sys

sys.path.append("server/src")

from feedback import score_words_cer

# fmt: off
PHONE_PAIRINGS_BY_WORD = [
    ("calling", [(("kʰ", 0, 1), ("kʰ", 0, 1)), (("ɔ", 1, 2), ("ɔ", 1, 2)), (("l", 2, 3), ("l", 2, 3)), (("ɪ", 3, 4), ("ɪ", 3, 4)), (("ŋ", 4, 5), ("ŋ", 4, 5))]),
    ("cards", [(("kʰ", 5, 6), ("kʰ", 5, 6)), (("ɑ", 6, 7), ("ɑ", 6, 7)), (("ɹ", 7, 8), ("ɹ", 7, 8)), (("d", 8, 9), ("d", 8, 9)), (("z", 9, 10), ("z", 9, 10))]),
    ("are", [(("ɑ", 10, 11), ("ɑ", 10, 11)), (("ɹ", 11, 12), ("ɹ", 11, 12))]),
    ("the", [(("ð", 12, 13), ("ð", 12, 13)), (("ə", 13, 14), ("ə", 13, 14))]),
    ("wave", [(("w", 14, 15), ("w", 14, 15)), (("eɪ", 15, 16), ("eɪ", 15, 16)), (("v", 16, 17), ("v", 16, 17))]),
    ("of", [(("ə", 17, 18), ("ə", 17, 18)), (("v", 18, 19), ("v", 18, 19))]),
    ("the", [(("ð", 19, 20), ("ð", 19, 20)), (("ə", 20, 21), ("ə", 20, 21))]),
    ("future", [(("f", 21, 22), ("f", 21, 22)), (("j", 22, 23), ("j", 22, 23)), (("u", 23, 24), ("u", 23, 24)), (("tʃ", 24, 25), ("tʃ", 24, 25)), (("ɜ˞", 25, 26), ("ə˞", 25, 26))]),
]
# fmt: on


def test_score_words_cer():
    words, overall_score = score_words_cer(PHONE_PAIRINGS_BY_WORD)
    assert round(overall_score, 2) == 0.97

    for _, score in words[:-1]:
        assert score == 1.0
    assert words[-1][1] == 0.8
